-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2019 年 06 月 18 日 16:09
-- 伺服器版本： 10.3.15-MariaDB
-- PHP 版本： 7.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `網頁設計2`
--

-- --------------------------------------------------------

--
-- 資料表結構 `food`
--

CREATE TABLE `food` (
  `food_id` varchar(5) NOT NULL,
  `food_name` varchar(30) NOT NULL,
  `food_kind` varchar(5) NOT NULL,
  `food_image` varchar(10) NOT NULL,
  `address` varchar(30) NOT NULL,
  `storehour` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `food`
--

INSERT INTO `food` (`food_id`, `food_name`, `food_kind`, `food_image`, `address`, `storehour`) VALUES
('A1', '巷子義大利麵', '食物', '', ' 台北市松山區民生東路五段144巷4號', '11:30~21:30'),
('A10', '六順豆花', '食物', '', '台北市松山區新東街26巷1-1號', '13:00~22:00'),
('A11', '大鎮川味食堂', '食物', '', '台北市松山區民生東路五段144巷8號', '11:00~14:00 17:00~20'),
('A12', '彩雲南滇味美食', '食物', '', '台北市松山區新中街6巷20號', '11:30~14:00 17:00~21'),
('A13', '香港大排檔', '食物', '', '台北市松山區三民路113巷22號', '11:00~14:00 17:00~21'),
('A14', '張媽媽牛肉麵民生店', '食物', '', '台北市松山區民生東路五段138巷13號', '11:00~14:30 17:00~20'),
('A15', '法華素食餐廳', '食物', '', '台北市松山區三民路113巷10號', '11:00~14:00 17:30~20'),
('A16', '大間拉麵', '食物', '', '台北市松山區三民路113巷6號', '11:30~14:00 17:00~20'),
('A17', '侯門小館', '食物', '', '台北市松山區民生東路五段180號', '11:30~14:00 17:30~20'),
('A18', '牛鼎牛肉火鍋', '食物', '', '台北市松山區三民路113巷17號', '11:00~20:30'),
('A19', '櫻桃小鎮', '食物', '', '台北市松山區三民路113巷15號', '11:30~14:30 17:30~21'),
('A2', '錦富日本料理', '食物', '', '台北市松山區民生東路五段137巷6弄36號', '12:00~14:00 18:00~21'),
('A20', '虱家虱目魚肚粥', '食物', '', '台北市松山區三民路157號', '11:00~21:00'),
('A21', '三佰斤茶飲', '飲品', '', '台北市松山區民生東路五段202-2號', '11:00~21:00'),
('A22', '龜記茗品', '飲品', '', '台北市松山區三民路113巷1-2號', '10:00~22:30'),
('A23', 'say juice 如果說', '飲品', '', '台北市松山區三民路113巷9-1號', '11:00~21:00'),
('A24', '匠喝嫩仙草', '飲品', '', '臺北市松山區民生東路5段192-6號', '11:30~22:00'),
('A25', '茶涎', '飲品', '', '台北市松山區富錦街532號', '10:30~20:30'),
('A26', '台茶一號', '飲品', '', '台北市松山區民生東路四段77號', '10:30~22:30'),
('A27', '小黑糖BARONESS', '飲品', '', '台北市松山區南京東路三段335巷5號', '11:00~20:00'),
('A28', '合集良飲', '飲品', '', '台北市松山區八德路四段 No. 214', '11:00~19:00'),
('A29', '泰讚了thai like tea', '飲品', '', '台北市松山區市民大道五段37號', '15:30~04:00'),
('A3', '好食年代涮涮屋', '食物', '', '台北市松山區民生東路五段137巷4弄31號', '11:00~14:30 17:00~21'),
('A30', '耘享濃豆乳', '飲品', '', '台北市松山區民生東路四段80巷1弄6號', '12:00~20:30'),
('A31', '琅茶舖', '飲品', '', '台北市松山區民生東路五段36巷8弄23號', '13:00~19:00'),
('A32', '愛喫茶甘蔗檸檬專賣店', '飲品', '', '台北市松山區南京東路五段23巷4號', '10:30~19:30'),
('A33', '心樂園鮮果茶飲', '飲品', '', '台北市松山區民生東路四段66號', '11:00~22:30'),
('A34', '林茶手搖風', '飲品', '', '台北市松山區南京東路五段291巷20弄21號', '09:00~22:00'),
('A35', '季緣 O RI-RI TEA', '飲品', '', '台北市松山區南京東路四段133巷5弄2號', '10:00~22:00'),
('A36', '良辰吉時', '飲品', '', '台北市大安區大安路一段51巷21-6號', '12:00~21:00'),
('A37', '一心豪飲', '飲品', '', '台北市信義區基隆路一段147巷8號', '12:00~22:00'),
('A38', 'degugu 果果迪特調水果茶', '飲品', '', '台北市中山區復興北路366號', '11:30~21:00'),
('A39', 'tea water', '飲品', '', '台北市松山區南京東路三段303巷6弄1-1號', '10:30~19:00'),
('A4', '廣合涼麵', '食物', '', '台北市松山區三民路136巷12號', '07:30~13:00'),
('A40', '七盞茶', '飲品', '', '台北市松山區南京東路五段123巷33號', '10:00~22:00'),
('A41', '富錦樹353咖啡', '咖啡', '', '台北市松山區富錦街353號', '9:00~20:00'),
('A42', '樂樂咖啡', '咖啡', '', '台北市松山區延壽街129號', '11:00~23:00'),
('A43', '民生工寓', '咖啡', '', '台北市松山區民生東路四段56巷1弄3號', '10:00~22:00'),
('A44', '松果院子', '咖啡', '', '台北市松山區富錦街449號', '11:00~21:00'),
('A45', '敝所咖啡Bison Cafe', '咖啡', '', '台北市松山區富錦街507號', '08:00~17:00'),
('A46', 'Leisure Cafe', '咖啡', '', '台北市松山區敦化北路145巷44號   ', '10:30~21:00'),
('A47', '小春日和動物雜貨・ 珈琲', '咖啡', '', '台北市松山區延壽街361號1樓', '11:00~21:00'),
('A48', '小草作 X Tea Shop', '咖啡', '', '台北市松山區延壽街175號1樓', '11:00~22:00'),
('A49', '九州鬆餅', '咖啡', '', '台北市松山區富錦街413號', '09:30~21:00'),
('A5', '山東鹿家莊麵食館', '食物', '', '台北市松山區三民路131號', '11:30~14:00 17:30~20'),
('A50', 'De’A 咖啡&包包複合店', '咖啡', '', '台北市松山區富錦街348號', '12:00~20:00'),
('A51', 'All Day Roasting Company', '咖啡', '', '台北市松山區延壽街329號', '10:00~23:00'),
('A52', '六丁目咖啡', '咖啡', '', '台北市松山區新中街6巷7號', '12:00~22:00'),
('A53', 'Dousun Cafe’左先生咖啡', '咖啡', '', '台北市松山區延壽街139號', '14:30~03:00'),
('A54', 'Cafe’ Showroom', '咖啡', '', '台北市松山區富錦街462號', '10:00~18:00'),
('A55', 'Afterhours Cafe', '咖啡', '', '台北市松山區延壽街117-1號', '11:00~19:00'),
('A56', 'Cafe Mode 木馬', '咖啡', '', '台北市松山區富錦街376號', '10:00~20:00'),
('A57', 'Cafe Ballet 芭蕾咖啡館', '咖啡', '', '台北市松山區民生東路五段36巷8弄62號', '08:30~21:30'),
('A58', 'Red Circle', '咖啡', '', '台北市松山區富錦街464號', '10:00~18:00'),
('A59', 'coffee & work', '咖啡', '', '台北市松山區民生東路四段55巷3弄14號', '10:00~22:00'),
('A6', '三片吐司', '食物', '', '台北市松山區民生東路五段153-4號', '06:00~14:00'),
('A60', 'SHAWN Coffee', '咖啡', '', '台北市松山區新中街8巷16號', '11:00~17:00'),
('A7', '泰嘟嘟-泰式咖哩', '食物', '', '台北市松山區民生東路五段153-3號', '11:00~21:00'),
('A8', '二馬番茄牛肉刀削麵', '食物', '', '台北市松山區民生東路五段137巷2之1號', '11:00~14:00 17:00~20'),
('A9', '日田立食屋', '食物', '', '號新中街8巷松山區台北市105', '11:00~14:00 17:00~21');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `food`
--
ALTER TABLE `food`
  ADD PRIMARY KEY (`food_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
